# Pandas

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one dimensional array like object, while a DataFrame is a two dimensional, size-mutable, and potentially heterogenous tabular data structure with labeled axes (rows and columns).

In [2]:
import pandas as pd

In [4]:
# Series

data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)
type(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

pandas.core.series.Series

In [5]:
data_dict = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
series_dict = pd.Series(data_dict)
print(series_dict)
type(series_dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

pandas.core.series.Series

In [7]:
# DataFrame

data = {
    'Name': ['Satvik', 'Ishita', 'Rajni'],
    'Age': [19, 20, 50],
    'City': ['Chennai', 'Chennai', 'Delhi'],
}

df = pd.DataFrame(data)
print(df)
type(df)

     Name  Age     City
0  Satvik   19  Chennai
1  Ishita   20  Chennai
2   Rajni   50    Delhi

pandas.core.frame.DataFrame

In [8]:
import numpy as np
np.array(df)

array([['Satvik', 19, 'Chennai'],
       ['Ishita', 20, 'Chennai'],
       ['Rajni', 50, 'Delhi']], dtype=object)

In [13]:
# Create data frame from a list of dictionaries

data = [
    {'Name': 'Satvik', 'Age': 19, 'City': 'Chennai'},
    {'Name': 'Ishita', 'Age': 20, 'City': 'Chennai'},
    {'Name': 'Rajni', 'Age': 50, 'City': 'Delhi'},
]

df = pd.DataFrame(data)
print(df)

     Name  Age     City
0  Satvik   19  Chennai
1  Ishita   20  Chennai
2   Rajni   50    Delhi

In [15]:
print(df['Name'])
type(df['Name'])

0    Satvik
1    Ishita
2     Rajni
Name: Name, dtype: object

pandas.core.series.Series

In [16]:
print(df.loc[0])
type(df.loc[0])

Name     Satvik
Age          19
City    Chennai
Name: 0, dtype: object

pandas.core.series.Series

In [17]:
df.at[1, 'Age']

np.int64(20)

In [28]:
df.iloc[1][0:]

Name     Ishita
Age          20
City    Chennai
Name: 1, dtype: object

In [29]:
df.loc[1][1:]

Age          20
City    Chennai
Name: 1, dtype: object

In [30]:
df

     Name  Age     City
0  Satvik   19  Chennai
1  Ishita   20  Chennai
2   Rajni   50    Delhi

In [33]:
df['Salary']=[20000, 2000, 1000000]

In [34]:
df

     Name  Age     City   Salary
0  Satvik   19  Chennai    20000
1  Ishita   20  Chennai     2000
2   Rajni   50    Delhi  1000000

In [46]:
new_df = df.drop('Salary', axis=1, inplace=False)

In [47]:
df

     Name  Age     City   Salary
0  Satvik   19  Chennai    20000
1  Ishita   20  Chennai     2000
2   Rajni   50    Delhi  1000000

In [48]:
new_df

     Name  Age     City
0  Satvik   19  Chennai
1  Ishita   20  Chennai
2   Rajni   50    Delhi

In [49]:
df.describe()

             Age          Salary
count   3.000000        3.000000
mean   29.666667   340666.666667
std    17.616280   571070.340092
min    19.000000     2000.000000
25%    19.500000    11000.000000
50%    20.000000    20000.000000
75%    35.000000   510000.000000
max    50.000000  1000000.000000

In [59]:
# Merging and joining dataframes

df1 = pd.DataFrame({'Key':['A', 'B', 'C'], 'Value1': [1, 2, 3]})
df2 = pd.DataFrame({'Key':['A', 'B', 'D'], 'Value2': [4, 5, 6]})

In [60]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [61]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [62]:
# Merge data frame on key columns

pd.merge(df1, df2, on="Key", how="inner")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [63]:
pd.merge(df1, df2, on="Key", how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [66]:
pd.merge(df1, df2, on="Key", how="left")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [67]:
pd.merge(df1, df2, on="Key", how="right")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

Reading Data

In [69]:
import ssl
import urllib.request

In [70]:
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv"
context = ssl._create_unverified_context()
data = urllib.request.urlopen(url, context=context)
df = pd.read_csv(data, sep=';')

In [72]:
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [77]:
# Redaing from html

url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list"
context = ssl._create_unverified_context()
data = urllib.request.urlopen(url, context=context)
df = pd.read_html(data)

In [79]:
df[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543